"use strict"

//if5
//Даны три целых числа. Найти количество положительных и количество отрицательных чисел в исходном наборе.

const {getRandomIntInterval} = require('./utils');

let a = getRandomIntInterval(-1000,1000);
let b = getRandomIntInterval(-1000,1000);
let c = getRandomIntInterval(-1000,1000);

let k = 0;
let z = 0;
let n = 0;
if (a > 0 ) {
    k++;
} else if (a < 0 ) {
    z++;
} else {
    n++;
}
if (b > 0 ) {
    k++;
} else if (b < 0 ) {
    z++;
} else {
    n++;
}
if (c > 0 ) {
    k++;
} else if (c < 0 ) {
    z++;
} else {
    n++;
}

console.log("Среди чисел " + a + " " + b + " " + c + "Положительных: " + k + " , Отрицательных: " + z);

//time 41min


/* Код до осознания своей глупости:
if (a !== 0 && b !== 0 && c !== 0) {
    if ((a > 0 && b < 0 && c < 0) || (b > 0 && a < 0 && c < 0) || (c > 0 && b < 0 && a < 0)) {
        console.log("Среди чисел " + a + " " + b + " " + c + " одно положительное и два отрицательных")
    } else if ((a > 0 && c > 0 && b < 0) || (a > 0 && b > 0 && c < 0) || ( a < 0 && b > 0 && c > 0)) {
        console.log("Среди чисел " + a + " " + b + " " + c + " два положительных и одно отрицательное")
    } else if (a > 0 && b > 0 && c > 0 ) {
        console.log("Среди чисел " + a + " " + b + " " + c + " все числа положительные")
    } else  if (a < 0 && b < 0 && c < 0) {
        console.log("Среди чисел " + a + " " + b + " " + c + " все числа отрицательные")
    }
} else if ((a === 0 && b !== 0 && c !== 0) || (b === 0 && a !== 0 && c !== 0) || (c === 0 && b !== 0 && a !== 0)){
    if (a === 0) {
        if (b > 0 && c > 0) {
            console.log("Среди чисел " + a + " " + b + " " + c + " два положительные и одно 0")
        } else if (b < 0 && c < 0) {
            console.log("Среди чисел " + a + " " + b + " " + c + " два отрицательные и одно 0")
        } else {
            console.log("Среди чисел " + a + " " + b + " " + c + " одно положительное, одно отрицательное и одно 0")
        }
    } else if (b === 0) {
        if (a > 0 && c > 0) {
            console.log("Среди чисел " + a + " " + b + " " + c + " два положительные и одно 0")
        } else if (a < 0 && c < 0) {
            console.log("Среди чисел " + a + " " + b + " " + c + " два отрицательные и одно 0")
        } else {
            console.log("Среди чисел " + a + " " + b + " " + c + " одно положительное, одно отрицательное и одно 0")
        }
    } else if (c === 0) {
        if (a > 0 && b > 0) {
            console.log("Среди чисел " + a + " " + b + " " + c + " два положительные и одно 0")
        } else if (a < 0 && b < 0) {
            console.log("Среди чисел " + a + " " + b + " " + c + " два отрицательные и одно 0")
        } else {
            console.log("Среди чисел " + a + " " + b + " " + c + " одно положительное, одно отрицательное и одно 0")
        }
    }
} else if ((a === 0 && b === 0 && c !== 0) || (a === 0 && b !== 0 && c === 0) || (a !== 0 && b === 0 && a === 0)) {
    if (c !== 0) {
        if (c > 0) {
            console.log("Среди чисел " + a + " " + b + " " + c + " одно положительное и два равно 0")
        } else if (c < 0) {
            console.log("Среди чисел " + a + " " + b + " " + c + " одно отрицательное и два равно 0")
        }
    } else if (b !== 0) {
        if (b > 0) {
            console.log("Среди чисел " + a + " " + b + " " + c + " одно положительное и два равно 0")
        } else if (b < 0) {
            console.log("Среди чисел " + a + " " + b + " " + c + " одно отрицательное и два равно 0")
        }
    } else {
        if (a > 0) {
            console.log("Среди чисел " + a + " " + b + " " + c + " одно положительное и два равно 0")
        } else if (a < 0) {
            console.log("Среди чисел " + a + " " + b + " " + c + " одно отрицательное и два равно 0")
        }
    }
} else {
    console.log("Среди чисел " + a + " " + b + " " + c + " все числа равны 0")
}

//time 40min

 */